In [30]:
import pandas as p
import numpy as np
data=p.array([1,2,3,4,4])
data

<IntegerArray>
[1, 2, 3, 4, 4]
Length: 5, dtype: Int64

In [32]:
import pandas as p
import numpy as n
data=n.array(["a","b","c","d"])
S=p.Series(data)
print(S)

0    a
1    b
2    c
3    d
dtype: object

In [4]:
import pandas as p
import numpy as n
data=n.array(["a","b","c","d"])
S=p.Series(data,index=[1,2,3,4])
print(S)

1    a
2    b
3    c
4    d
dtype: object

In [5]:
data={'name':'ajith',
      'age':23
     }
S=p.Series(data)
print(S)

name    ajith
age        23
dtype: object

In [35]:
import pandas as pd
df=pd.read_csv("https://raw.githubusercontent.com/nethajinirmal13/Training-datasets/main/titanic_train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [83]:
df.fillna(150,inplace=True)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,150,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,150,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,150,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,150,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,150.0,1,2,W./C. 6607,23.4500,150,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,150,Q

In [84]:
df["Cabin"].fillna(2, inplace=True)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,150,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,150,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,150,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,150,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,150.0,1,2,W./C. 6607,23.4500,150,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,150,Q

In [39]:
x=df["Parch"].mean()
df["Parch"].fillna(x,inplace=True)
x

0.38159371492704824

In [86]:
x=df["Age"].mode()[0]
df["Age"].fillna(x,inplace=True)
x

150.0

In [88]:
for x in df.index:
    if df.loc[x,"Age"]>1:
        
        df.loc[x,"Age"]=20
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,20.0,1,0,A/5 21171,7.2500,150,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,20.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,20.0,0,0,STON/O2. 3101282,7.9250,150,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,20.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,20.0,0,0,373450,8.0500,150,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,20.0,0,0,211536,13.0000,150,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,20.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,20.0,1,2,W./C. 6607,23.4500,150,S
889,890,1,1,"Behr, Mr. Karl Howell",male,20.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,20.0,0,0,370376,7.7500,150,Q

In [89]:
x=df["Age"].median()
df["Age"].fillna(x,inplace=True)
x

20.0

In [40]:
df.dropna(subset=["Embarked"],inplace=True)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [42]:
import pandas as pd
import numpy as np
d={'name':pd.Series(['tom','james','ricky','vin','']),
  'age':pd.Series([20,20,]),
  'rating':pd.Series([2,3,4,6,np.nan])
  }
df=pd.DataFrame(d)
print(df)

    name   age  rating
0    tom  20.0     2.0
1  james  20.0     3.0
2  ricky   NaN     4.0
3    vin   NaN     6.0
4          NaN     NaN

In [44]:
df.fillna(130,inplace=True)
df

    name    age  rating
0    tom   20.0     2.0
1  james   20.0     3.0
2  ricky  130.0     4.0
3    vin  130.0     6.0
4         130.0     3.0

In [48]:
df["rating"].fillna(3, inplace=True)
df

    name    age  rating
0    tom   20.0     2.0
1  james   20.0     3.0
2  ricky  130.0     4.0
3    vin  130.0     6.0
4         130.0     3.0

In [45]:
x=df["rating"].mean()
df["rating"].fillna(x,inplace=True)
x

29.0

In [40]:
x=df["rating"].mode()[0]
df["rating"].fillna(x,inplace=True)
x

3.0

In [18]:
for x in df.index:
    if df.loc[x,"rating"]>1:
        
        df.loc[x,"rating"]=20

In [24]:
df

    name   age  rating
0    tom  20.0     2.0
1  james  20.0     3.0
2  ricky   NaN     4.0
3    vin   NaN     6.0
4          NaN     NaN

In [21]:
for x in df.index:
    if df.loc[x,"rating"]>1:
        
        df.drop(x,inplace=True)

In [22]:
df

Empty DataFrame
Columns: [name, age, rating]
Index: []

In [92]:
import pandas as pd
data = {'year':[10,11,12,11,12,10,11,12],
        'team':['csk','mi','mi','srh','kkr','csk','csk','csk'],
        'wins':[11,8,10,15,11,6,10,4],
        'rank':[5,8,6,1,5,10,6,12]}
ipl =pd.DataFrame(data)
ipl.groupby(['team','year']).groups

{('csk', 10): [0, 5], ('csk', 11): [6], ('csk', 12): [7], ('kkr', 12): [4], ('mi', 11): [1], ('mi', 12): [2], ('srh', 11): [3]}

In [94]:
grouped=ipl.groupby('year')
for name,group in grouped:
    print(name)
    print(group)

10
   year team  wins  rank
0    10  csk    11     5
5    10  csk     6    10
11
   year team  wins  rank
1    11   mi     8     8
3    11  srh    15     1
6    11  csk    10     6
12
   year team  wins  rank
2    12   mi    10     6
4    12  kkr    11     5
7    12  csk     4    12

In [95]:
grouped=ipl.groupby('year')
grouped.get_group(12)

   year team  wins  rank
2    12   mi    10     6
4    12  kkr    11     5
7    12  csk     4    12

In [96]:
grouped=ipl.groupby('year')
grouped['rank'].agg(np.mean)

year
10    7.500000
11    5.000000
12    7.666667
Name: rank, dtype: float64

In [97]:
grouped=ipl.groupby('year')
grouped['rank'].agg([np.sum,np.mean,np.std])

      sum      mean       std
year
10     15  7.500000  3.535534
11     15  5.000000  3.605551
12     23  7.666667  3.785939

In [50]:
import pandas as pd
Addr=['CompanyName','StreetName','City','State','pincode']
df=pd.read_csv('/Users/ajithmurali/Downloads/Agilisium.csv',names=Addr)
df

,CompanyName,StreetName,City,State,pincode
0,Agilisium Consulting LLC,2629 Townsgate Rd Suite 235,Westlake Village,CA,91361
1,Agilisium Consulting India Private Limited,5/142 Rajiv Gandhi Salai Perungudi,Chennai,TN,600096

In [ ]:
Excel:

In [17]:
import pandas as pd
data=pd.read_excel(r"/Users/ajithmurali/Downloads/Project.xlsx")
data

,Unnamed: 0,SI,User story,Tasks
0,0,1.0,Project understaning - Customer segmentation,NaN
1,1,2.0,Requirement analysis,NaN
2,2,3.0,Design Analysis,understanding Approach
3,3,4.0,Getting AWS environment access,"User creation and Access for S3 , Sagemaker an..."
4,4,5.0,Analyse Data,NaN
5,5,13.0,Workflow scripts,"Create the workflow scripts for Process, condi..."
6,6,14.0,Empty,Register model
7,7,15.0,Empty,Parametrized Pipeline executions
8,8,16.0,Hyper parameter tuning,NaN
9,9,17.0,Endpoints,NaN
10,10,18.0,Visualisation,connecting Notebook with Quicksight
11,11,19.0,Empty,Creating dashboard
12,12,20.0,Unit testing,NaN
13,13,21.0,Code review,NaN
14,14,22.0,Devops CICD,creation of cicd pipeline
15,15,24.0,Model monitoring,NaN
16,16,NaN,NaN,NaN
17,17,NaN,create data pipeline to productionise the mode...,Access the S3

In [20]:
data.fillna("Empty",inplace=True)

In [23]:
data.to_excel(r"/Users/ajithmurali/Downloads/Project.xlsx")

In [ ]:
json:

In [38]:
import pandas as pd
import json
data='{"column1":{"row1":11,"row2":12,"row3":13},"column2":{"row1":"XX","row2":"YY","row3":"ZZ"}}'
df=pd.read_json(data)
print(df)

      column1 column2
row1       11      XX
row2       12      YY
row3       13      ZZ

In [39]:
from pandas.io.json import json_normalize
import pandas as pd
url="https://api.exchangerate-api.com/v4/latest/usd"
df=pd.read_json(url)
print(df)

                             provider  \
AED  https://www.exchangerate-api.com
AFN  https://www.exchangerate-api.com
ALL  https://www.exchangerate-api.com
AMD  https://www.exchangerate-api.com
ANG  https://www.exchangerate-api.com
..                                ...
XPF  https://www.exchangerate-api.com
YER  https://www.exchangerate-api.com
ZAR  https://www.exchangerate-api.com
ZMW  https://www.exchangerate-api.com
ZWL  https://www.exchangerate-api.com

                          WARNING_UPGRADE_TO_V6  \
AED  https://www.exchangerate-api.com/docs/free
AFN  https://www.exchangerate-api.com/docs/free
ALL  https://www.exchangerate-api.com/docs/free
AMD  https://www.exchangerate-api.com/docs/free
ANG  https://www.exchangerate-api.com/docs/free
..                                          ...
XPF  https://www.exchangerate-api.com/docs/free
YER  https://www.exchangerate-api.com/docs/free
ZAR  https://www.exchangerate-api.com/docs/free
ZMW  https://www.exchangerate-api.com/docs/free
ZWL  https://www.exchangerate-api.com/docs/free

                                      terms base       date  \
AED  https://www.exchangerate-api.com/terms  USD 2022-03-17
AFN  https://www.exchangerate-api.com/terms  USD 2022-03-17
ALL  https://www.exchangerate-api.com/terms  USD 2022-03-17
AMD  https://www.exchangerate-api.com/terms  USD 2022-03-17
ANG  https://www.exchangerate-api.com/terms  USD 2022-03-17
..                                      ...  ...        ...
XPF  https://www.exchangerate-api.com/terms  USD 2022-03-17
YER  https://www.exchangerate-api.com/terms  USD 2022-03-17
ZAR  https://www.exchangerate-api.com/terms  USD 2022-03-17
ZMW  https://www.exchangerate-api.com/terms  USD 2022-03-17
ZWL  https://www.exchangerate-api.com/terms  USD 2022-03-17

     time_last_updated   rates
AED         1647475202    3.67
AFN         1647475202   87.31
ALL         1647475202  111.97
AMD         1647475202  497.78
ANG         1647475202    1.79
..                 ...     ...
XPF         1647475202  108.48
YER         1647475202  250.12
ZAR         1647475202   14.98
ZMW         1647475202   17.74
ZWL         1647475202  134.15

[161 rows x 7 columns]

In [24]:
import pandas as pd
import json
data=pd.read_json(r"/Users/ajithmurali/Downloads/Projectjson.json")
data

,Unnamed: 0,SI,User story,Tasks
0,0,1.0,Project understaning - Customer segmentation,None
1,1,2.0,Requirement analysis,None
2,2,3.0,Design Analysis,understanding Approach
3,3,4.0,Getting AWS environment access,"User creation and Access for S3 , Sagemaker an..."
4,4,5.0,Analyse Data,None
5,5,13.0,Workflow scripts,"Create the workflow scripts for Process, condi..."
6,6,14.0,Empty,Register model
7,7,15.0,Empty,Parametrized Pipeline executions
8,8,16.0,Hyper parameter tuning,None
9,9,17.0,Endpoints,None
10,10,18.0,Visualisation,connecting Notebook with Quicksight
11,11,19.0,Empty,Creating dashboard
12,12,20.0,Unit testing,None
13,13,21.0,Code review,None
14,14,22.0,Devops CICD,creation of cicd pipeline
15,15,24.0,Model monitoring,None
16,16,NaN,None,None
17,17,NaN,create data pipeline to productionise the mode...,Access the S3

In [25]:
import json
data=[['Ajith',23],['Ashok',27],['Anand',25]]
df=pd.DataFrame(data,columns=['Name','Age'])
df.to_json(r'Ajith.json')

In [26]:
df

    Name  Age
0  Ajith   23
1  Ashok   27
2  Anand   25

In [41]:
import json
df=pd.read_excel(r"/Users/ajithmurali/Downloads/Project.xlsx")
df.to_json(r'/Users/ajithmurali/Downloads/Projectjson.json')

In [44]:
df_f=pd.read_json(r'/Users/ajithmurali/Downloads/Projectjson.json')

In [1]:
import pandas as pd
data = {'year':[10,11,12,11,12,],
        'team':['csk','mi','mi','srh','kkr'],
        'wins':[11,8,10,15,11],
        'losses':[5,8,6,1,5]}
index_labels=['r1','r2','r3','r4','r5']      
ipl=pd.DataFrame(data,index=index_labels)
print(ipl)

    year team  wins  losses
r1    10  csk    11       5
r2    11   mi     8       8
r3    12   mi    10       6
r4    11  srh    15       1
r5    12  kkr    11       5

In [17]:
#print(ipl.loc['r1'])
#print(ipl.loc[ipl['wins']>=11])
#print(ipl.loc[list(ipl['wins']>=11)])
#print(ipl.iloc[1])
#print(ipl.loc[:,'team'])
#print(ipl.iloc[:,0])
#print(ipl.loc[['r1','r2']])
#print(ipl.iloc[[0,2]])
#print(ipl.loc[:,["year","team","losses"]])
#print(ipl.iloc[:,[0,1,3]])
#print(ipl.loc[:,"year":"losses"])
#print(ipl.iloc[:,0:4])
#print(ipl.loc['r1':'r4':2])
#print(ipl.iloc[0:4:2])
#print(ipl.loc[:,'year':'losses':2])
#print(ipl.iloc[:,1:4:2])

   team  losses
r1  csk       5
r2   mi       8
r3   mi       6
r4  srh       1
r5  kkr       5

In [105]:
import pandas as pd
data1 = {'year':[10,25,12,11,12,],
        'team':['csk','mi','mi','srh','kkr']}
index_labels1=['r1','r2','r3','r4','r5']      
ipl1=pd.DataFrame(data1,index=index_labels1)
data2 = {'year':[10,11,20,11,30,],
         'losses':[5,8,6,1,5]}
index_labels2=['r1','r2','r3','r4','r5']      
ipl2=pd.DataFrame(data2,index=index_labels2)

In [106]:
ipl1

    year team
r1    10  csk
r2    25   mi
r3    12   mi
r4    11  srh
r5    12  kkr

In [107]:
ipl2

    year  losses
r1    10       5
r2    11       8
r3    20       6
r4    11       1
r5    30       5

In [108]:
ipl3=ipl1.join(ipl2,lsuffix="_left",rsuffix="_right")
ipl3

    year_left team  year_right  losses
r1         10  csk          10       5
r2         25   mi          11       8
r3         12   mi          20       6
r4         11  srh          11       1
r5         12  kkr          30       5

In [109]:
ipl3=ipl1.join(ipl2,lsuffix="_left",rsuffix="_right",how="inner")
ipl3

    year_left team  year_right  losses
r1         10  csk          10       5
r2         25   mi          11       8
r3         12   mi          20       6
r4         11  srh          11       1
r5         12  kkr          30       5

In [103]:
ipl3=ipl1.join(ipl2,lsuffix="_left",rsuffix="_right",how='right')
ipl3

    year_left team  year_right  losses
r1         10  csk          10       5
r2         11   mi          11       8
r3         12   mi          12       6
r4         11  srh          11       1
r5         12  kkr          12       5

In [113]:
ipl3=ipl1.join(ipl2,lsuffix="_left",rsuffix="_right",how='outer')
print(ipl3)

    year_left team  year_right  losses
r1         10  csk          10       5
r2         25   mi          11       8
r3         12   mi          20       6
r4         11  srh          11       1
r5         12  kkr          30       5

In [112]:
ipl3=ipl1.set_index('year').join(ipl2.set_index('year'),how='inner')
print(ipl3)

     team  losses
year
10    csk       5
11    srh       8
11    srh       1

In [114]:
import pandas as pd
data1 = {'year':[10,25,12,11,12,],
        'team':['csk','mi','mi','srh','kkr']}
index_labels1=['r1','r2','r3','r4','r5']      
ipl1=pd.DataFrame(data1,index=index_labels1)
data2 = {'year':[10,11,20,11,30,],
         'losses':[5,8,6,1,5]}
index_labels2=['r1','r2','r3','r4','r5']      
ipl2=pd.DataFrame(data2,index=index_labels2)

In [115]:
ipl3=pd.merge(ipl1,ipl2)
ipl3

   year team  losses
0    10  csk       5
1    11  srh       8
2    11  srh       1

In [116]:
ipl3=ipl1.merge(ipl2)
ipl3

   year team  losses
0    10  csk       5
1    11  srh       8
2    11  srh       1

In [118]:
ipl3=pd.merge(ipl1,ipl2,on='year')
ipl3

   year team team_x team_y  losses
0    10  csk    csk    csk       5
1    11  srh    srh    srh       8
2    11  srh    srh    srh       1

In [119]:
import pandas as pd
data1=pd.DataFrame({"Courses":["ajith","ashok","Anand"],
                   "Age":[24,25,27]})

data2=pd.DataFrame({"Courses":["kumar","Thala","Roman"],
                   "Age":[23,28,26]})
data=[data1,data2]
data3=pd.concat(data)
print(data3)

  Courses  Age
0   ajith   24
1   ashok   25
2   Anand   27
0   kumar   23
1   Thala   28
2   Roman   26

In [120]:
data3=pd.concat([data1,data2],ignore_index=True,sort=False)
print(data3)

  Courses  Age
0   ajith   24
1   ashok   25
2   Anand   27
3   kumar   23
4   Thala   28
5   Roman   26

In [121]:
data3=pd.concat([data1,data2])
print(data3)

  Courses  Age
0   ajith   24
1   ashok   25
2   Anand   27
0   kumar   23
1   Thala   28
2   Roman   26

In [124]:
data3=data1.sort_values('Courses',ascending=False)
print(data3)

  Courses  Age
1   ashok   25
0   ajith   24
2   Anand   27

In [126]:
data3=data1.sort_values(by=['Courses','Age'])
print(data3)

  Courses  Age
2   Anand   27
0   ajith   24
1   ashok   25

In [130]:
class car:
    def __init__(self,color,model):
        self.color=color
        self.model=model
    def color(self):
        print(self.model)
obj= car('blue','honda')
obj.model

'honda'

In [131]:
class A:
    def start(self):
        print("start the A")
class B(A):
    def end(self):
        print("ending the B")
C=B()
C.start()
C.end()

start the A
ending the B

In [132]:
class A:
    name=""
class B:
    Id="ABC"
class C(A,B):
    Age="20"
obj=C()
obj.name="Ajith"
print(obj.name)
print(obj.Id)
print(obj.Age)

Ajith
ABC
20

In [63]:
name=['Ajith','Ashojk','Anand']
eob=enumerate(name)
x=next(eob)
print(x)
y=next(eob)
print(y)
z=next(eob)
print(z)

(0, 'Ajith')
(1, 'Ashojk')
(2, 'Anand')

In [135]:
name=['Ajith','Ashojk','Anand']
for i,j in enumerate(name):
    print(i,j)

0 Ajith
1 Ashojk
2 Anand

In [136]:
import pandas as pd
data=pd.Series(['a','b','c'],dtype="category")
data

0    a
1    b
2    c
dtype: category
Categories (3, object): ['a', 'b', 'c']

In [138]:
data=pd.Categorical(['a','b','c','a','b','d'])
data

['a', 'b', 'c', 'a', 'b', 'd']
Categories (4, object): ['a', 'b', 'c', 'd']

In [139]:
data=pd.Categorical(['a','b','c','a','b','d'],['a','b','c'],ordered=True)
data

['a', 'b', 'c', 'a', 'b', NaN]
Categories (3, object): ['a' < 'b' < 'c']

In [140]:
import numpy as np
a=np.array(42)
b=np.array([1,4,5])
c=np.array([[4,5]])
d=np.array([[[6,7]]])
print(a.ndim)
print(b.ndim)
print(c.ndim)
print(d.ndim)

0
1
2
3

In [150]:
import numpy as np
data=np.array([1,2,3,4,5,6,7,8,9])
data

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [151]:
newarr=data.reshape(3,3)
newarr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [153]:
new=data.reshape(-1)
new

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [154]:
data=np.array([[1,2,3],[4,5,6]])
for x in data:
    print(x)

[1 2 3]
[4 5 6]

In [155]:
data=np.array([[1,2,3],[4,5,6]])
for x in data:
    for y in x:
        
        print(y)

1
2
3
4
5
6

In [156]:
data=np.array([[1,2,3],[4,5,6]])
for x in np.nditer(data):
    print(x)

1
2
3
4
5
6

In [164]:
arr1=np.array([1,2,3])
arr2=np.array([4,5,6])
arr3=np.hstack((arr1,arr2))
print(arr3)

[1 2 3 4 5 6]

In [165]:
arr1=np.array([1,2,3])
arr2=np.array([4,5,6])
arr3=np.vstack((arr1,arr2))
print(arr3)

[[1 2 3]
 [4 5 6]]

In [168]:
arr1=np.array([1,2,3,4,5,6])
new=np.array_split(arr1,3)
print(new)

[array([1, 2]), array([3, 4]), array([5, 6])]

In [17]:
class plane:
    def __init__(self):
        self.wings=2
        self.drive()
        self.flaps()
        self.wheels()
    def drive(self):
        print("Acclerating")
    def flaps(self):
        print("changing flaps")
    def wheels(self):
        print("closing wheels")
obj=plane()

Acclerating
changing flaps
closing wheels

In [25]:
class A:
    def __init__(self):
        self.wings=5
class B:
    def __init__(self):
        self.alpha=2
        self.beta=2
ob=A()
ob1=B()
print(ob.wings)
print(ob1.alpha)

5
2

In [27]:
class Friend:
    def __init__(self):
        self.job='none'
    def getjob(self):
        return self.job
    def setjob(self,job):
        self.job=job
        
A=Friend()
G=Friend()
A.setjob("rtdtrdr")
G.setjob("hteytfyfg")
print(A.job)
print(G.job)

rtdtrdr
hteytfyfg

In [54]:
class A:
    def f1(self):
        print("dtrd")
class B:
    def f2(self):
        print("hbh")
class C(A,B):
    def f3(self):
        print("vgdtc")
ob=C()
ob.f1()
ob.f2()
ob.f3()

dtrd
hbh
vgdtc

In [60]:
class Music():
    @staticmethod
    def play():
        print("gcxgfvjhb")
    def stop(self):
        print("biubnj")
Music.play()
ob=Music()
ob.stop()

gcxgfvjhb
biubnj

In [62]:
class fru:
    name="apple"
    @classmethod
    def printname(cls):
        print('The name is:', cls.name)
fru.printname()   
Apple=fru()
Berry=fru()
Apple.printname()
Berry.printname()

The name is: apple
The name is: apple
The name is: apple